In [3]:
import pandas as pd

In [4]:
df = pd.read_csv("results/results20009-1.csv")

In [14]:
df.sort_values(by="score", ascending=False)

     u   v  true     score  pred
8   38  39   1.0  0.998922     1
1   33  40   1.0  0.998082     1
6   56  66   1.0  0.947267     1
7    5  67   1.0  0.935145     1
10  67  40   0.0  0.886055     1
3   46  71   1.0  0.829607     1
9   21  22   0.0  0.810230     1
13  45  35   0.0  0.786735     1
2    3  16   1.0  0.774181     1
5   48  49   1.0  0.750799     1
0    9  32   1.0  0.701405     1
17  20  60   0.0  0.689170     1
11  56  31   0.0  0.668306     1
4    5  18   1.0  0.532370     1
16  12  41   0.0  0.525306     1
15  25  32   0.0  0.523789     1
12   0  48   0.0  0.306343     0
14  10  75   0.0  0.267326     0

In [6]:
df_false_pos = df[(df["true"] == 0) & (df["pred"] == 1)]
df_false_neg = df[(df["true"] == 1) & (df["pred"] == 0)]
df_true_pos = df[(df["true"] == 1) & (df["pred"] == 1)]

In [7]:
df_true_pos.sort_values(by="score", ascending=False).head()

    u   v  true     score  pred
8  38  39   1.0  0.998922     1
1  33  40   1.0  0.998082     1
6  56  66   1.0  0.947267     1
7   5  67   1.0  0.935145     1
3  46  71   1.0  0.829607     1

In [8]:
df_false_neg

Empty DataFrame
Columns: [u, v, true, score, pred]
Index: []

In [9]:
df_model = pd.read_csv("results/df_20009-1.csv")

In [10]:
df_model.iloc[[32]]

,part_id,color,x,y,z,a,b,c,d,e,...,part,part_name,part_cat_id,year_from,year_to,category_name,dim1,dim2,dim3,bracket_info
32,32,7,0.0,-40.0,120.0,-1.0,0.0,0.0,0.0,1.0,...,3020,Plate 2 x 4,14.0,1962.0,2025.0,Plates,2.0,4.0,NaN,NaN

In [11]:
df_model.iloc[[10]]

,part_id,color,x,y,z,a,b,c,d,e,...,part,part_name,part_cat_id,year_from,year_to,category_name,dim1,dim2,dim3,bracket_info
10,10,7,30.0,-32.0,130.0,-1.0,0.0,0.0,0.0,1.0,...,43711,Wedge Sloped 4 x 2 Triple Right,6.0,2003.0,2025.0,Bricks Wedged,4.0,2.0,NaN,NaN

In [12]:
df_model[(df_model["part"]== "4287")]

,part_id,color,x,y,z,a,b,c,d,e,...,part,part_name,part_cat_id,year_from,year_to,category_name,dim1,dim2,dim3,bracket_info
46,46,7,0.0,-48.0,-10.0,-1.0,0.0,0.0,0.0,1.0,...,4287,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [13]:
df_model[(df_model["part"]== "3023")]

,part_id,color,x,y,z,a,b,c,d,e,...,part,part_name,part_cat_id,year_from,year_to,category_name,dim1,dim2,dim3,bracket_info
30,30,7,30.0,-40.0,40.0,0.0,0.0,1.0,0.0,1.0,...,3023,Plate 1 x 2,14.0,1962.0,2025.0,Plates,1.0,2.0,NaN,NaN
31,31,7,-30.0,-40.0,40.0,0.0,0.0,1.0,0.0,1.0,...,3023,Plate 1 x 2,14.0,1962.0,2025.0,Plates,1.0,2.0,NaN,NaN
63,63,8,30.0,24.0,0.0,0.0,0.0,1.0,0.0,1.0,...,3023,Plate 1 x 2,14.0,1962.0,2025.0,Plates,1.0,2.0,NaN,NaN
64,64,8,-30.0,24.0,160.0,0.0,0.0,1.0,0.0,1.0,...,3023,Plate 1 x 2,14.0,1962.0,2025.0,Plates,1.0,2.0,NaN,NaN
65,65,8,-30.0,24.0,0.0,0.0,0.0,1.0,0.0,1.0,...,3023,Plate 1 x 2,14.0,1962.0,2025.0,Plates,1.0,2.0,NaN,NaN
66,66,8,30.0,24.0,160.0,0.0,0.0,1.0,0.0,1.0,...,3023,Plate 1 x 2,14.0,1962.0,2025.0,Plates,1.0,2.0,NaN,NaN
70,70,7,0.0,-56.0,-20.0,0.0,0.0,-1.0,0.0,1.0,...,3023,Plate 1 x 2,14.0,1962.0,2025.0,Plates,1.0,2.0,NaN,NaN
71,71,8,0.0,-56.0,40.0,0.0,0.0,-1.0,0.0,1.0,...,3023,Plate 1 x 2,14.0,1962.0,2025.0,Plates,1.0,2.0,NaN,NaN